[
  {
    "code": "SAÉ 4.01",
    "backgroundImage": "images/porjects/pizza.png",
    "title": "API REST Pizzaland",
    "description": "Le principal objectif de ce projet est de créer une API REST grâce à Apache Tomcat dans le contexte d'une pizzeria, en modélisant une base de données dans PostgreSQL. L'API se connectera à cette base de données pour effectuer différentes actions telles que la récupération, l'ajout et la mise à jour des ingrédients, des pizzas, des types de pâtes et des commandes avec des réponses au format JSON. Nous avons utilisé GitLab pour la gestion des versions, car ce projet était réalisé en binôme.",
    "skills": {
      "technicalSkills": [
        "API REST",
        "Apache Tomcat",
        "PostgreSQL",
        "GitLab"
      ],
      "softSkills": [
        "Capacité à résoudre les problèmes et à trouver des solutions techniques",
        "Capacité à travailler en équipe (projet réalisé en binôme)"
      ],
      "otherSoftskills": [
        "Rigueur dans la modélisation de la base de données",
        "Organisation et gestion du temps pour respecter les délais du projet",
        "Adaptabilité aux changements et capacité à s'ajuster aux demandes du client ou du partenaire de projet"
      ]
    },
    "pointOfView": {
      "myStrength": [
        "Maîtrise de la création d'une API REST avec Apache Tomcat",
        "Compréhension de la modélisation d'une base de données avec PostgreSQL",
        "Capacité à effectuer des actions variées sur la base de données (récupération, ajout, mise à jour)",
        "Expérience dans l'utilisation de GitLab pour la gestion des versions",
        "Collaboration et communication au sein de l'équipe de projet"
      ],
      "myWeakness": [
        "Compréhension complexe des exigences spécifiques liées à la modélisation de la base de données pour une pizzeria",
        "Gestion des erreurs et des exceptions lors de la connexion de l'API à la base de données"
      ],
      "myUpgrade": [
        "Améliorer le système de réponses pour la prise en charge du format XML",
        "Créer des relations pour implémenter un système d’utilisateur pour les commandes"
      ]
    },
    "conclusion": "Dans l'ensemble, ce projet nous a permis d'acquérir de précieuses compétences techniques et de travailler en équipe sur un projet concret. Nous sommes fiers des résultats obtenus et nous sommes prêts à appliquer ces apprentissages dans de futurs projets similaires"
  },
  {
    "code": "SAÉ 1.02",
    "title": "Logiciels Ludo-pédagogiques",
    "description": "Le but de cette SAÉ était de réaliser un logiciel ludo-pédagogique permettant d'apprendre de nouvelles choses en jouant à un jeu vidéo sur un terminal. Nous avons choisi de développer un jeu de rôle au tour par tour (comme le jeu vidéo “Undertale”) nommée UnderSchool où le joueur doit répondre correctement aux questions pour attaquer les ennemis, les question étant basé sur l'élément du monstre avec chacun des question sur une matière précise, nous avions aussi un inventaire complètement fonctionnelle avec des armure, des arme et des consommables",
    "skills": {
      "technicalSkills": [
        "Java",
        "Travail d'équipe"
      ],
      "softSkills": [
        "Capacité à résoudre et analyser des problèmes techniques",
        "Capacité à travailler en équipe pour le développement de logiciels",
        "Connaissance des langages de programmation telle que Java"
      ],
      "otherSoftskills": [
        "Créativité pour la conception de jeux vidéo",
        "Capacité à s'adapter aux besoins des utilisateurs",
        "Connaissance des matières enseignées dans le jeu pour concevoir des questions appropriées."
      ]
    },
    "pointOfView": {
      "myStrength": [
        "Le concept de combiner l'apprentissage avec le jeu vidéo est innovant et attrayant pour les utilisateurs",
        "Le choix d'un jeu de rôle au tour par tour permet de créer une expérience engageante et interactive",
        "L'inclusion d'un inventaire fonctionnel avec des armures, des armes et des consommables ajoute de la profondeur au gameplay",
        "La capacité de sauvegarder et de charger des parties permet aux joueurs de reprendre leur progression ultérieurement",
        "La connaissance des matières enseignées et la conception de questions appropriées démontrent une compréhension pédagogique du projet"
      ],
      "myWeakness": [
        "Concevoir des questions pertinentes pour chaque élément de monstre et matière peut nécessiter une recherche approfondie et une expertise dans les domaines éducatifs correspondants"
      ],
      "myUpgrade": [
        "Une plus grande variété de fonctionnalités dans l'inventaire, comme des capacités spéciales ou des améliorations, pourrait rendre le jeu encore plus attrayant",
        "L'ajout de graphismes, de sons et d'une interface utilisateur plus attrayants pourrait améliorer l'expérience globale du jeu",
        "La prise en compte des retours des utilisateurs et des enseignants pour améliorer la pertinence pédagogique et l'efficacité de l'apprentissage"
      ]
    },
    "conclusion": "Dans l'ensemble, le projet a réussi à combiner l'apprentissage et le jeu vidéo de manière créative. La réalisation d'un logiciel ludo-pédagogique complexe tel que UnderSchool nécessite une expertise technique et pédagogique. Le jeu offre une expérience interactive, engageante et éducative pour les joueurs. Cependant, il reste des possibilités d'amélioration pour enrichir l'expérience du joueur, augmenter la pertinence pédagogique et assurer une meilleure adaptabilité aux besoins des utilisateurs. Avec des ajustements et des itérations supplémentaires, UnderSchool pourrait devenir un outil précieux pour l'apprentissage ludique"
  },
  {
    "code": "SAÉ 1.03",
    "title": "Installation d’une machine virtuelle",
    "description": "Dans le cadre de notre projet, nous avons réalisé l'installation d'un système Linux à partir d'une image ISO complète en utilisant Oracle Virtualbox. Nous avons procédé à la configuration du proxy, à la gestion des droits des utilisateurs, ainsi qu'à la gestion des gestionnaires de paquets pour installer des logiciels tels qu'Emacs et VSCodium. Par ailleurs, nous avons approfondi nos connaissances en mettant en place un dual boot, permettant l'utilisation simultanée de deux systèmes d'exploitation. Cette expérience nous a permis de développer des compétences techniques précieuses en matière de configuration et de gestion de systèmes Linux. En résumé, notre projet a été une étape complète et enrichissante dans l'installation et la configuration d'un environnement Linux fonctionnel.",
    "skills": {
      "technicalSkills": [
        "Installation d'OS partir d'une image ISO",
        "Configuration de Linux",
        "Configuration du proxy et gestion des droits des utilisateurs",
        "Gestion des gestionnaires de paquets pour l'installation de logiciels",
        "Mise en place d'un dual boot pour l'utilisation simultanée de deux systèmes d'exploitation",
        "Virtualbox"
      ],
      "softSkills": [
        "Capacité à résoudre des problèmes techniques et à trouver des solutions efficaces",
        "Sens de l'organisation et capacité à suivre des procédures d'installation et de configuration",
        "Esprit d'analyse pour comprendre les erreurs et les messages d'erreur lors de l'installation et de la configuration",
        "Patience et persévérance pour surmonter les défis techniques et les obstacles rencontrés"
      ],
      "otherSoftskills": [
        "Communication claire et efficace pour partager des informations techniques avec les collègues",
        "Attitude proactive et motivation pour apprendre de nouvelles compétences et développer ses connaissances techniques",
        "Souci du détail et rigueur dans l'exécution des tâches liées à l'installation et à la configuration"
      ]
    },
    "pointOfView": {
      "myStrength": [
        "Réussite de l'installation d'un système Linux à partir d'une image ISO complète",
        "Configuration efficace du proxy et gestion des droits des utilisateurs",
        "Maîtrise des gestionnaires de paquets pour l'installation de logiciels supplémentaires",
        "Mise en place réussie d'un dual boot pour l'utilisation simultanée de deux systèmes d'exploitation",
        "Acquisition de compétences techniques précieuses en configuration et gestion de systèmes Linux",
        "Capacité à travailler en équipe et à communiquer efficacement avec les membres du projet"
      ],
      "myWeakness": [
        "Adaptation à la configuration spécifique du proxy et résolution des problèmes de connectivité réseau."
      ],
      "myUpgrade": [
        "Approfondir les connaissances sur la configuration avancée du proxy pour une meilleure gestion de la connectivité réseau",
        "Se familiariser davantage avec la virtualisation en utilisant des outils autres que Virtualbox pour élargir les compétences techniques"
      ]
    },
    "conclusion": "Dans l'ensemble, notre projet d'installation et de configuration d'un système Linux a été une expérience réussie. Nous avons atteint nos objectifs en installant le système à partir d'une image ISO, en configurant le proxy et en gérant les droits des utilisateurs. Nous avons également pu installer des logiciels supplémentaires et mettre en place un dual boot. Cette expérience nous a permis d'acquérir des compétences techniques précieuses en matière de configuration et de gestion de systèmes Linux. Bien que nous ayons rencontré des difficultés dans la mise en œuvre, nous avons pu les surmonter grâce à notre esprit d'équipe et à notre persévérance. Nous avons identifié des points à améliorer, notamment en renforçant nos connaissances sur la configuration du proxy et en élargissant notre maîtrise des gestionnaires de paquets. Ce projet a été une étape complète et enrichissante dans notre parcours informatique"
  },
  {
    "code": "SAÉ 1.04",
    "title": "Introduction aux bases de données",
    "description": "Notre projet consistait à créer une base de données à l'aide du logiciel Microsoft Access. L'objectif principal était de modéliser avec précision le fonctionnement d'une entreprise. Pour cela, nous avons d'abord élaboré un Modèle Conceptuel de Données (MCD) en identifiant les entités et les associations les plus importantes pour une entreprise. Ensuite, nous avons programmé ce MCD dans le système de gestion de base de données (SGBD) d'Access. Nous avons également rempli les tables correspondantes avec des données pertinentes afin d'illustrer les formulaires, les états et les requêtes que nous avons développés. L'ensemble de notre travail visait à créer une base de données fonctionnelle et représentative du fonctionnement d'une entreprise, en utilisant les fonctionnalités d'Access pour faciliter la manipulation et l'analyse des données.",
    "skills": {
      "technicalSkills": [
        "Maîtrise de Microsoft Access pour la conception et la gestion de bases de données.",
        "Capacité à coder des tables, des formulaires, des états et des requêtes dans un SGBD.",
        "Connaissance des bonnes pratiques en matière de structuration et d'optimisation des bases de données.",
        "Aptitude à importer, exporter et intégrer des données provenant de différentes sources dans une base de données Access.",
        "Capacité à créer des interfaces utilisateur conviviales et fonctionnelles pour faciliter l'interaction avec la base de données."
      ],
      "softSkills": [
        "Esprit analytique pour comprendre les besoins et les processus d'une entreprise et les traduire en une structure de base de données adéquate.",
        "Aptitude à travailler de manière autonome et à prendre des initiatives pour résoudre les problèmes et améliorer les processus."
      ],
      "otherSoftskills": [
        "Rigueur et précision dans la conception et la gestion des données, en veillant à leur exactitude et à leur intégrité.",
        "Sens de l'organisation pour structurer et documenter clairement la base de données et ses composants."
      ]
    },
    "pointOfView": {
      "myStrength": [
        "Une compréhension approfondie des concepts de modélisation de données et de la création de schémas relationnels, ce qui a permis de concevoir une base de données solide et bien structurée.",
        "Une maîtrise avancée du logiciel Microsoft Access, permettant de tirer pleinement parti de ses fonctionnalités pour développer des formulaires, des états et des requêtes efficaces.",
        "Une attention particulière accordée à la convivialité de l'interface utilisateur, en créant des formulaires intuitifs et des états clairs pour faciliter l'utilisation de la base de données."
      ],
      "myWeakness": [
        "La complexité des entités et des associations les plus pertinentes."
      ],
      "myUpgrade": [
        "Renforcer les compétences dans la gestion des performances de la base de données, en optimisant les requêtes et les indexes pour améliorer les temps de réponse."
      ]
    },
    "conclusion": "Dans l'ensemble, notre projet de création d'une base de données avec Microsoft Access a été une expérience enrichissante. Nous avons réussi à modéliser efficacement le fonctionnement d'une entreprise et à développer une base de données fonctionnelle et conviviale. Malgré quelques difficultés rencontrées, notre équipe a su faire preuve de compétences techniques solides et d'une bonne collaboration. Nous avons identifié des axes d'amélioration pour renforcer nos compétences en matière de gestion des performances, d'automatisation et de documentation. Ce projet nous a permis de consolider nos connaissances en matière de conception de bases de données et d'acquérir une expérience précieuse dans l'utilisation d'Access."
  },
  {
    "code": "SAÉ 1.05 + 1.06",
    "title": "Recueil des besoins / Découverte de l’environnement économique",
    "description": "Le but de cette SAÉ était de réaliser une plateforme de location et de covoiturage. Son objectif était divisé en deux parties : tout d'abord, recueillir les besoins des clients et proposer une réponse adaptée, puis découvrir l'environnement économique afin d'optimiser les coûts et la pollution liée à l'utilisation des transports pour un trajet d'un lieu variable vers un lieu fixe. Au cours de ce projet, nous avons dû apprendre à réaliser divers sondages auprès de vrais professionnels pour recueillir leurs avis sur les modes de transport utilisés, les distances parcourues jusqu'à leur lieu de travail, etc…, Nous avons aussi dû réalisé une   Ensuite, j'ai dû argumenter et défendre ma solution lors de la présentation orale de projets.",
    "skills": {
      "technicalSkills": [
        "Création d’un prototype d’un site web",
        "Identification d’un besoins d’un client",
        "Vendre un projet à l'oral",
        "Réalisation d’une vidéo démonstrative",
        "Wordpress"
      ],
      "softSkills": [
        "Utiliser efficacement des outils de collecte de données.",
        "Capacité à analyser les données recueillies pour en tirer des conclusions (par exemple Google Forms).",
        "Capacité à utiliser des logiciels de présentation pour communiquer efficacement une solution."
      ],
      "otherSoftskills": [
        "Avoir le sens de l'organisation pour une gestion de projet efficace.",
        "Communiquer efficacement avec les professionnels pour recueillir leurs avis.",
        "Avoir la capacité à travailler en équipe pour développer une solution.",
        "Faire preuve de créativité pour proposer une solution innovante."
      ]
    },
    "pointOfView": {
      "myStrength": [
        "Compétences avancées en création de maquettes de sites sur Wordpress.",
        "Expertise dans la réalisation de pages web.",
        "Rapidité et efficacité dans la réalisation de sondages auprès des professionnels.",
        "Capacité à travailler en binôme et à mobiliser le réseau professionnel pour obtenir des informations pertinentes."
      ],
      "myWeakness": [
        "Difficulté à comprendre les exigences du sujet en raison du manque d'informations essentielles fournies en temps opportun."
      ],
      "myUpgrade": [
        "Élargir le réseau professionnel pour obtenir des avis et des feedbacks plus diversifiés."
      ]
    },
    "conclusion": "En conclusion, cette SAÉ a permis de développer diverses compétences techniques et savoir-être en informatique. Notre objectif était de concevoir une plateforme de location et de covoiturage en deux parties : recueillir les besoins des clients et comprendre l'environnement économique pour optimiser les coûts et la pollution. Nous avons réalisé des sondages auprès de professionnels pour obtenir leurs avis sur les modes de transport et les distances parcourues. De plus, nous avons présenté notre solution, créé un prototype de site web et une vidéo démonstrative. Les compétences techniques incluaient la création de maquettes sur Wordpress et l'identification des besoins des clients, tandis que les savoir-être concernaient l'utilisation efficace des outils de collecte de données et l'analyse des informations recueillies."  
  },
  {
    "code": "SAÉ 2.03",
    "title": "Installation de services réseaux",
    "description": "Notre projet consistait à mettre en place un service réseau en utilisant Gitea sur une machine virtuelle. Pour documenter chaque étape de la mise en place de ce service, nous avons choisi de rédiger une documentation au format Markdown, étant plus largement connu. En parallèle, nous avons réalisé une vidéo de démonstration d'environ dix minutes, dans laquelle nous avons expliqué en anglais les différentes étapes, en nous appuyant sur une vidéo enregistrée avec le logiciel OBS. À la demande du professeur, nous sommes apparus dans cette vidéo pour faciliter la compréhension. Ensuite, nous avons rédigé un document écrit pour expliquer notre démarche de manière vulgarisée, afin que quiconque puisse la comprendre.",
    "skills": {
      "technicalSkills": [
        "Gitea",
        "Markdone",
        "OBS",
        "Anglais",
        "Virtualbox"
      ],
      "softSkills": [
        "Capacité à résoudre des problèmes techniques en cherchant des solutions adaptées.",
        "Habileté à travailler de manière méthodique et organisée pour suivre les étapes de configuration.",
        "Esprit d'analyse et de déduction pour comprendre les problèmes éventuels et les erreurs de configuration."
      ],
      "otherSoftskills": [
        "Capacité à communiquer clairement et efficacement pour vulgariser des concepts techniques.",
        "Esprit d'équipe pour collaborer avec d'autres membres du projet et partager les connaissances.",
        "Patience et persévérance pour surmonter les éventuels obstacles techniques.",
        "Sens de l'organisation pour gérer le temps et les ressources disponibles de manière efficiente."
      ]
    },
    "pointOfView": {
      "myStrength": [
        "Maîtrise de la mise en place d'un service réseau avec Gitea, ce qui permet de faciliter la collaboration et le partage de code au sein d'une équipe.",
        "Utilisation d'outils de documentation tels que Markdown pour créer des guides clairs et concis, rendant l'installation et la configuration du service plus accessibles.",
        "Capacité à créer une vidéo de démonstration illustrant visuellement les étapes du processus, ce qui facilite la compréhension et l'apprentissage.",
        "Combinaison de compétences techniques et linguistiques en anglais, permettant une communication fluide et une documentation de qualité."
      ],
      "myWeakness": [
        "Configuration initiale de la machine virtuelle et de Gitea, nécessitant une compréhension approfondie des concepts réseaux et des outils de virtualisation.",
        "Résolution des éventuels problèmes techniques ou erreurs de configuration lors de l'installation du service, pouvant demander des recherches approfondies et des ajustements."
      ],
      "myUpgrade": [
        "Renforcer la documentation écrite en fournissant des exemples supplémentaires et des explications plus détaillées pour chaque étape."
      ]
    },
    "conclusion": "Notre projet de mise en place d'un service réseau avec Gitea sur une machine virtuelle a été un succès, notamment grâce à notre précédente SAÉ 1.03 qui nous a permis de gagner énormément de temps dans l’installation du système. Nous avons démontré notre expertise dans la configuration et la documentation technique en utilisant des outils tels que Markdown et OBS. Malgré certaines difficultés techniques, nous avons surmonté les obstacles et réussi à fournir une documentation claire et accessible. Nous sommes conscients des points à améliorer, notamment en renforçant la documentation écrite. Dans l'ensemble, ce projet nous a permis de développer nos compétences techniques et de travailler en équipe, tout en fournissant un résultat concret et utile pour quiconque souhaite mettre en place un service Gitea."
  },
  {
    "code": "SAÉ 2.04",
    "title": "Exploitation d'une base de données",
    "description": "Cette SAÉ a pour objectif d'acquérir une compréhension approfondie d'un ensemble de données réelles en utilisant PostgreSQL en suivant plusieurs étapes essentielles tel que la lecture d’un document au format csv. Elle se concentre sur l'importation et la normalisation des données, ainsi que sur l'exécution de requêtes classiques et statistiques. De plus, elle vise à représenter, analyser et présenter les données avec un regard critique. Ainsi, cette SAÉ permet de maîtriser l'ensemble du processus, de l'importation à la présentation des données, en mettant l'accent sur la compréhension, la cohérence et la pertinence des résultats obtenus. En résumé, elle développe les compétences nécessaires pour travailler efficacement avec des données réelles et réaliser des rapports détaillés.",
    "skills": {
      "technicalSkills": [
        "PostgreSQL",
        "SQL",
        "Maîtrise de PostgreSQL : Importation de données à partir de fichiers CSV, normalisation des données, exécution de requêtes classiques et statistiques.",
        "Compréhension des ensembles de données réelles : Capacité à analyser et interpréter les données fournies, ainsi qu'à identifier les tendances, les modèles et les relations entre les variables.",
        "Analyse critique des résultats : Capacité à évaluer les résultats obtenus, à les interpréter de manière contextuelle et à formuler des conclusions pertinentes."

      ],
      "softSkills": [
        "Capacité à travailler avec des données réelles en veillant à l'exactitude des informations et à la cohérence des résultats.",
        "Capacité à résoudre des problèmes liés à la manipulation et à l'analyse de données, en utilisant les outils et les ressources appropriés.",
        "Esprit d'analyse et de déduction pour comprendre les problèmes éventuels et les erreurs de configuration."
      ],
      "otherSoftskills": [
        "Capacité à travailler de manière indépendante et à gérer efficacement son temps et ses ressources pour mener à bien le projet.",
        "Souplesse pour s'adapter à de nouveaux ensembles de données, à des exigences changeantes et à des situations imprévues.",
        "Aptitude à communiquer clairement et de manière concise, tant à l'écrit qu'à l'oral, en partageant les résultats et les conclusions de manière compréhensible pour un public non technique."
      ]
    },
    "pointOfView": {
      "myStrength": [
        "Bonne maîtrise de PostgreSQL et des compétences techniques nécessaires pour travailler avec des données réelles.",
        "Capacité à importer et à normaliser des données provenant de fichiers CSV, ainsi qu'à exécuter des requêtes classiques et statistiques.",
        "Compétence dans l'analyse et l'interprétation des ensembles de données, en identifiant les tendances, les modèles et les relations entre les variables.",
        "Capacité à représenter les données de manière claire et informative grâce à la création de visualisations appropriées.",
        "Esprit critique développé pour évaluer les résultats obtenus et formuler des conclusions pertinentes.",
        "Maîtrise du processus de gestion des données, de l'importation à la présentation des résultats."
      ],
      "myWeakness": [
        "Manipulation et nettoyage des données réelles qui peuvent contenir des erreurs, des valeurs manquantes ou d'autres problèmes qui nécessitent une attention particulière."
      ],
      "myUpgrade": [
        "Approfondir les compétences en analyse statistique pour une meilleure optimisation des tables."
      ]
    },
    "conclusion": "La réalisation de ce projet permettra d'acquérir des compétences solides en gestion et en analyse de données réelles en utilisant PostgreSQL. Les étapes clés, telles que l'importation, la normalisation, l'analyse et la présentation des données, seront maîtrisées, permettant ainsi de travailler efficacement avec des ensembles de données réelles dans divers domaines. Malgré les défis potentiels liés à la qualité des données, à l'interprétation des résultats et à la gestion du temps, ce projet offre une occasion précieuse de développer des compétences techniques et des compétences transversales essentielles pour travailler dans le domaine de l'informatique et de l'analyse de données."
  },
  {
    "code": "SAÉ 2.05 + 2.06",
    "title": "Gestion de projet et Travail d'équipe",
    "description": "Le principal objectif de ce projet est d'apprendre à travailler en équipe en utilisant plusieurs méthodes, telles que la méthode agile, et de créer un escape game avec une échéance précise. Pour atteindre cet objectif, nous avons organisé des réunions à chaque séance de travail, en rédigeant des comptes rendus pour faire le point sur les tâches restantes dans le projet. Afin de mieux visualiser les tâches à accomplir et celles en cours, nous avons utilisé l'outil Trello. En plus de développer le jeu sur Genially, nous avons également créé un teaser et conçu des affiches attrayantes à l'aide du logiciel Figma, dans le but d'augmenter la visibilité de notre projet, même s'il reste dans le cadre d'une simple SAÉ. En résumé, ce projet vise à améliorer notre travail d'équipe, à respecter les délais et à utiliser des outils efficaces pour mener à bien notre projet d'escape game.",
    "skills": {
      "technicalSkills": [
        "Agile",
        "Trello",
        "Genially",
        "Connaissance des principes de conception de jeux vidéo, y compris la mécanique de jeu, les niveaux de difficulté et l'interaction utilisateur.",
        "Figma pour créer des éléments visuels attrayants.",
        "Travailler en équipe en suivant une méthode agile."
      ],
      "softSkills": [
        "Capacité à travailler de manière autonome et à rechercher activement des solutions techniques lorsque cela est nécessaire.",
        "Capacité à faire preuve de créativité et d'innovation dans la conception du jeu et la résolution de problèmes.",
        "Esprit d'analyse et de déduction pour comprendre les problèmes éventuels et les erreurs de configuration."
      ],
      "otherSoftskills": [
        "Sens de la rigueur et de l'organisation pour gérer efficacement les tâches, les délais et les priorités du projet.",
        "Sens de l'initiative pour proposer des idées et des améliorations au projet.",
        "Capacité à faire preuve d'écoute active et à recevoir des critiques constructives pour améliorer son travail et celui de l'équipe."
      ]
    },
    "pointOfView": {
      "myStrength": [
        "Forte collaboration au sein de l'équipe, avec des réunions régulières et des comptes rendus pour maintenir une communication claire et efficace.",
        "Utilisation de la méthodologie agile pour une gestion flexible des tâches et une adaptation aux changements éventuels.",
        "Compétence dans l'analyse et l'interprétation des ensembles de données, en identifiant les tendances, les modèles et les relations entre les variables.",
        "Utilisation d'outils de gestion de projet tels que Trello pour visualiser les tâches et suivre les progrès.",
        "Création d'un teaser attrayant et de visuels accrocheurs pour promouvoir le jeu et susciter l'intérêt."
      ],
      "myWeakness": [
        "Équilibrage entre la créativité et la faisabilité technique pour créer une expérience de jeu captivante."
      ],
      "myUpgrade": [
        "Améliorer la planification et la répartition des tâches pour éviter les retards potentiels.",
        "Renforcer la collaboration en encourageant une communication plus fréquente et ouverte entre les membres de l'équipe."
      ]
    },
    "conclusion": "Dans l'ensemble, ce projet a permis de développer de solides compétences en travail d'équipe, en gestion de projet et en développement de jeux vidéo. Les méthodes agiles et les outils de gestion ont été des atouts majeurs pour maintenir une progression régulière et une communication efficace. Malgré quelques difficultés rencontrées, l'équipe a su les surmonter et a réussi à créer un escape game attrayant, soutenu par un teaser accrocheur et des visuels de qualité. Globalement, ce projet a été une expérience enrichissante dans le développement de jeux et le travail en équipe."
  }
]